# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],  # 2
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   [-1, 1, Conv, [64, 1, 1]],  # 4
   [-2, 1, Conv, [64, 1, 1]],  # 5
   [-1, 1, Conv, [64, 3, 1]],  # 6
   [-1, 1, Conv, [64, 3, 1]],  # 7
   [-1, 1, Conv, [64, 3, 1]],  # 8
   [-1, 1, Conv, [64, 3, 1]],  # 9
   [[-1, -3, -5, -6], 1, Concat, [1]],  # 10
   [-1, 1, Conv, [256, 1, 1]],  # 11
   [-1, 1, Conv, [256, 3, 1]],  # 12
         
   [-1, 1, MP, []],  # 13
   [-1, 1, Conv, [128, 1, 1]],  # 14
   [-3, 1, Conv, [128, 1, 1]],  # 15
   [-1, 1, Conv, [128, 3, 2]],  # 16
   [[-1, -3], 1, Concat, [1]],  # 17-P3/8  
   [-1, 1, Conv, [128, 1, 1]],  # 18
   [-2, 1, Conv, [128, 1, 1]],  # 19
   [-1, 1, Conv, [128, 3, 1]],  # 20
   [-1, 1, Conv, [128, 3, 1]],  # 21
   [-1, 1, Conv, [128, 3, 1]],  # 22
   [-1, 1, Conv, [128, 3, 1]],  # 23
   [[-1, -3, -5, -6], 1, Concat, [1]],  # 24
   [-1, 1, Conv, [512, 1, 1]],  # 25  
   [-1, 1, Conv, [512, 3, 1]],  # 26
         
   [-1, 1, MP, []],  # 27
   [-1, 1, Conv, [256, 1, 1]],  # 28
   [-3, 1, Conv, [256, 1, 1]],  # 29
   [-1, 1, Conv, [256, 3, 2]],  # 30
   [[-1, -3], 1, Concat, [1]],  # 31-P4/16  
   [-1, 1, Conv, [256, 1, 1]],  # 32
   [-2, 1, Conv, [256, 1, 1]],  # 33
   [-1, 1, Conv, [256, 3, 1]],  # 34
   [-1, 1, Conv, [256, 3, 1]],  # 35
   [-1, 1, Conv, [256, 3, 1]],  # 36
   [-1, 1, Conv, [256, 3, 1]],  # 37
   [[-1, -3, -5, -6], 1, Concat, [1]],  # 38
   [-1, 1, Conv, [1024, 1, 1]],  # 39
   [-1, 1, Conv, [1024, 3, 1]],  # 40
         
   [-1, 1, MP, []],  # 41
   [-1, 1, Conv, [512, 1, 1]],  # 42
   [-3, 1, Conv, [512, 1, 1]],  # 43
   [-1, 1, Conv, [512, 3, 2]],  # 44
   [[-1, -3], 1, Concat, [1]],  # 45-P5/32  
   [-1, 1, Conv, [256, 1, 1]],  # 46
   [-2, 1, Conv, [256, 1, 1]],  # 47
   [-1, 1, Conv, [256, 3, 1]],  # 48
   [-1, 1, Conv, [256, 3, 1]],  # 49
   [-1, 1, Conv, [256, 3, 1]],  # 50
   [-1, 1, Conv, [256, 3, 1]],  # 51
   [[-1, -3, -5, -6], 1, Concat, [1]],  # 52
   [-1, 1, Conv, [1024, 1, 1]],  # 53
   [-1, 1, Conv, [1024, 3, 1]],  # 54
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]],  # 55
  
   [-1, 1, Conv, [256, 1, 1]],  # 56
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 57
   [40, 1, Conv, [256, 1, 1]],  # 58 route backbone P4
   [[-1, -2], 1, Concat, [1]],  # 59
   
   [-1, 1, Conv, [256, 1, 1]],  # 60
   [-2, 1, Conv, [256, 1, 1]],  # 61
   [-1, 1, Conv, [128, 3, 1]],  # 62
   [-1, 1, Conv, [128, 3, 1]],  # 63
   [-1, 1, Conv, [128, 3, 1]],  # 64
   [-1, 1, Conv, [128, 3, 1]],  # 65
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],  # 66
   [-1, 1, Conv, [256, 1, 1]],  # 67
   [-1, 1, Conv, [256, 3, 1]],  # 68
   
   [-1, 1, Conv, [128, 1, 1]],  # 69
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 70
   [26, 1, Conv, [128, 1, 1]],  # 71 route backbone P3
   [[-1, -2], 1, Concat, [1]],  # 72
   
   [-1, 1, Conv, [128, 1, 1]],  # 73
   [-2, 1, Conv, [128, 1, 1]],  # 74
   [-1, 1, Conv, [64, 3, 1]],  # 75
   [-1, 1, Conv, [64, 3, 1]],  # 76
   [-1, 1, Conv, [64, 3, 1]],  # 77
   [-1, 1, Conv, [64, 3, 1]],  # 78
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],  # 79
   [-1, 1, Conv, [128, 1, 1]],  # 80
   [-1, 1, Conv, [128, 3, 1]],  # 81
      
   [-1, 1, MP, []],  # 82
   [-1, 1, Conv, [128, 1, 1]],  # 83
   [-3, 1, Conv, [128, 1, 1]],  # 84
   [-1, 1, Conv, [128, 3, 2]],  # 85
   [[-1, -3, 63], 1, Concat, [1]],  # 86
   
   [-1, 1, Conv, [256, 1, 1]],  # 87
   [-2, 1, Conv, [256, 1, 1]],  # 88
   [-1, 1, Conv, [128, 3, 1]],  # 89
   [-1, 1, Conv, [128, 3, 1]],  # 90
   [-1, 1, Conv, [128, 3, 1]],  # 91
   [-1, 1, Conv, [128, 3, 1]],  # 92
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],  # 93
   [-1, 1, Conv, [256, 1, 1]],  # 94
   [-1, 1, Conv, [256, 3, 1]],  # 95
      
   [-1, 1, MP, []],  # 96
   [-1, 1, Conv, [256, 1, 1]],  # 97
   [-3, 1, Conv, [256, 1, 1]],  # 98
   [-1, 1, Conv, [256, 3, 2]],  # 99
   [[-1, -3, 51], 1, Concat, [1]],  # 100
   
   [-1, 1, Conv, [512, 1, 1]],  # 101
   [-2, 1, Conv, [512, 1, 1]],  # 102
   [-1, 1, Conv, [256, 3, 1]],  # 103
   [-1, 1, Conv, [256, 3, 1]],  # 104
   [-1, 1, Conv, [256, 3, 1]],  # 105
   [-1, 1, Conv, [256, 3, 1]],  # 106
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],  # 107
   [-1, 1, Conv, [512, 1, 1]],  # 108
   [-1, 1, Conv, [512, 3, 1]],  # 109
   
   [86, 1, RepConv, [256, 3, 1]],  # 110
   [100, 1, RepConv, [512, 3, 1]],  # 111
   [109, 1, RepConv, [1024, 3, 1]],  # 112

   [[110,111,112], 1, IDetect, [nc, anchors]],  # 113 Detect(P3, P4, P5)
  ]